# Pandas

In [10]:
import pandas as pd
import numpy as np

# Series

In [8]:
asignaturas = ['Matemática', 'Historia', 'Economía', 'Programación', 'Inglés']

In [9]:
asignaturas

['Matemática', 'Historia', 'Economía', 'Programación', 'Inglés']

In [11]:
np.array(asignaturas)

array(['Matemática', 'Historia', 'Economía', 'Programación', 'Inglés'],
      dtype='<U12')

In [13]:
serie_1 = pd.Series(asignaturas)

In [14]:
serie_1

0      Matemática
1        Historia
2        Economía
3    Programación
4          Inglés
dtype: object

In [15]:
type(serie_1)

pandas.core.series.Series

In [21]:
diccionario = {'Matemática': 6.0, 'Economía': 4.5, 'Programación': 8.5}

In [33]:
serie_dict = pd.Series(diccionario)

# Atributos de una serie

In [27]:
serie_2 = pd.Series([1, 2, 2, 3, 3, 3, 4, 4, 4, 4])

In [28]:
serie_2

0    1
1    2
2    2
3    3
4    3
5    3
6    4
7    4
8    4
9    4
dtype: int64

In [29]:
serie_2.size

10

In [30]:
len(serie_2)

10

In [31]:
serie_2.index

RangeIndex(start=0, stop=10, step=1)

In [32]:
serie_2.dtype

dtype('int64')

In [34]:
serie_dict

Matemática      6.0
Economía        4.5
Programación    8.5
dtype: float64

In [38]:
serie_dict[2]

8.5

In [39]:
serie_dict['Programación']

8.5

In [40]:
serie_dict['Programación'] == serie_dict[2]

True

In [43]:
serie_dict.index[2]

'Programación'

In [45]:
array = np.arange(5, 30, 5)

In [46]:
array

array([ 5, 10, 15, 20, 25])

In [55]:
serie_3 = pd.Series(array)

In [56]:
serie_3

0     5
1    10
2    15
3    20
4    25
dtype: int32

In [60]:
serie_3.count()

5

In [61]:
serie_3.sum()

75

In [62]:
serie_3.cumsum()

0     5
1    15
2    30
3    50
4    75
dtype: int32

In [63]:
serie_3.value_counts()

5     1
10    1
15    1
20    1
25    1
dtype: int64

In [66]:
serie_2.value_counts()

4    4
3    3
2    2
1    1
dtype: int64

In [68]:
array_int = np.random.randint(5, 30, 100)

In [70]:
serie_int = pd.Series(array_int)

In [71]:
print(serie_int)

0     10
1     19
2     13
3     12
4     10
      ..
95    15
96    28
97    28
98    18
99    10
Length: 100, dtype: int32

In [84]:
serie_int.value_counts()

17    9
28    8
10    7
12    6
14    6
29    6
21    5
25    5
15    5
26    5
8     4
23    4
18    4
22    3
5     3
16    3
7     3
11    3
13    3
19    2
20    2
27    1
9     1
6     1
24    1
dtype: int64

In [86]:
serie_int.max()

29

In [87]:
serie_int.min()

5

In [88]:
serie_int.mean()

17.74

In [89]:
serie_int.std()

7.069096209001629

In [91]:
serie_int.describe()

count    100.000000
mean      17.740000
std        7.069096
min        5.000000
25%       12.000000
50%       17.000000
75%       24.250000
max       29.000000
dtype: float64

In [95]:
def to_string(numero):
    return 'valor: ' + str(numero)

In [96]:
to_string(1001)

'valor: 1001'

In [98]:
serie_int.apply(to_string)

0     valor: 10
1     valor: 19
2     valor: 13
3     valor: 12
4     valor: 10
        ...
95    valor: 15
96    valor: 28
97    valor: 28
98    valor: 18
99    valor: 10
Length: 100, dtype: object

In [100]:
serie_int[serie_int % 2 == 0]

0     10
3     12
4     10
6     16
10    18
11    22
16    12
20    28
22    26
23    12
26    26
28    28
29    28
30    14
32    22
33    26
37    10
39    26
40    14
46    26
48    16
49    12
51     8
52    18
57     8
58     8
59    14
60    20
62    14
63     6
64    22
65    28
66    10
67    28
71    20
72    10
73     8
74    12
75    12
76    18
77    14
79    10
81    14
83    24
87    28
89    16
96    28
97    28
98    18
99    10
dtype: int32

# DataFrames

In [101]:
datos = {
    'nombre': ['María', 'Luis', 'Carmen', 'Antonio'],
    'edad': [18, 22, 20, 21],
    'grado': ['Economía', 'Medicina', 'Arquitectura', 'Economía'],
    'correo': ['maria@gmail.com', 'luis@yahoo.es', 'carmen@gmail.com', 'antonio@gmail.com']
}

In [116]:
pd.DataFrame(datos, index=['alumno 1', 'alumno 2', 'alumno 3', 'alumno 4'])

           nombre  edad         grado             correo
alumno 1    María    18      Economía    maria@gmail.com
alumno 2     Luis    22      Medicina      luis@yahoo.es
alumno 3   Carmen    20  Arquitectura   carmen@gmail.com
alumno 4  Antonio    21      Economía  antonio@gmail.com

In [105]:
datos_2 = [['María', 10], ['Luis', 12]]

In [107]:
pd.DataFrame(datos_2, columns=['Nombre', 'Edad'])

  Nombre  Edad
0  María    10
1   Luis    12

# Creación de un data frame a partir de un archivo CSV o Excel

In [114]:
colesterol = pd.read_csv('colesterol.csv', sep=';', decimal=',')

In [115]:
colesterol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [153]:
emisiones = pd.read_csv(r"..\clase_2\Emisiones_CO2.csv", sep='|', encoding='latin-1', decimal=',', thousands='.')

In [154]:
emisiones

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
0,ABW,Aruba,América Latina y Caribe,1960,NaN,NaN
1,ABW,Aruba,América Latina y Caribe,1961,NaN,NaN
2,ABW,Aruba,América Latina y Caribe,1962,NaN,NaN
3,ABW,Aruba,América Latina y Caribe,1963,NaN,NaN
4,ABW,Aruba,América Latina y Caribe,1964,NaN,NaN
...,...,...,...,...,...,...
11122,ZWE,Zimbabue,África subsahariana,2007,9732.22,0.731867
11123,ZWE,Zimbabue,África subsahariana,2008,7682.37,0.569255
11124,ZWE,Zimbabue,África subsahariana,2009,8239.75,0.600521
11125,ZWE,Zimbabue,África subsahariana,2010,9028.15,0.646073
11126,ZWE,Zimbabue,África subsahariana,2011,9860.56,0.691698

In [155]:
emisiones.shape

(11127, 6)

In [156]:
emisiones['CO2 (kt)'].count()

9032

In [157]:
type(emisiones)

pandas.core.frame.DataFrame

In [158]:
emisiones['CO2 (kt)']

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
          ...
11122    9732.22
11123    7682.37
11124    8239.75
11125    9028.15
11126    9860.56
Name: CO2 (kt), Length: 11127, dtype: float64

In [159]:
type(emisiones['CO2 (kt)'])

pandas.core.series.Series

In [160]:
emisiones.describe()

                Año      CO2 (kt)  CO2 per cápita (toneladas métricas)
count  11127.000000  9.032000e+03                          9029.000000
mean    1985.502292  9.860744e+04                             4.340822
std       15.007733  4.663998e+05                             7.560692
min     1960.000000  3.667000e+00                             0.000580
25%     1973.000000  5.940540e+02                             0.348972
50%     1986.000000  4.327060e+03                             1.450587
75%     1998.500000  3.992446e+04                             5.953205
max     2011.000000  9.019518e+06                            99.840439

In [169]:
emisiones.head(3)

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
0,ABW,Aruba,América Latina y Caribe,1960,NaN,NaN
1,ABW,Aruba,América Latina y Caribe,1961,NaN,NaN
2,ABW,Aruba,América Latina y Caribe,1962,NaN,NaN

In [162]:
emisiones.tail(3)

,Código de país,Nombre del país,Región,Año,CO2 (kt),CO2 per cápita (toneladas métricas)
11124,ZWE,Zimbabue,África subsahariana,2009,8239.75,0.600521
11125,ZWE,Zimbabue,África subsahariana,2010,9028.15,0.646073
11126,ZWE,Zimbabue,África subsahariana,2011,9860.56,0.691698

In [163]:
emisiones.shape

(11127, 6)

In [164]:
emisiones.size

66762

In [165]:
11127*6

66762

In [166]:
emisiones.columns

Index(['Código de país', 'Nombre del país', 'Región', 'Año', 'CO2 (kt)',
       'CO2 per cápita (toneladas métricas)'],
      dtype='object')

In [167]:
emisiones.index

RangeIndex(start=0, stop=11127, step=1)

In [168]:
emisiones.dtypes

Código de país                          object
Nombre del país                         object
Región                                  object
Año                                      int64
CO2 (kt)                               float64
CO2 per cápita (toneladas métricas)    float64
dtype: object

In [170]:
colesterol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [182]:
colesterol.rename(columns={'nombre': 'Nombre completo', 'altura': 'estatura'})

,Nombre completo,edad,sexo,peso,estatura,colesterol,IMC
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.528510
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,21.718066
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,22.491349
4,Marisa López Collado,46,M,51.0,1.58,148.0,20.429418
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.799445
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.957274
7,Pilar Martín González,22,M,60.0,1.66,NaN,21.773842
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.913275
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.913806
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,20.957171
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.305471
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.803285
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,19.470778

In [173]:
colesterol.columns

Index(['nombre', 'edad', 'sexo', 'peso', 'altura', 'colesterol'], dtype='object')

In [174]:
colesterol.describe()

            edad        peso     altura  colesterol
count  14.000000   13.000000  14.000000   13.000000
mean   38.214286   70.923077   1.768571  220.230769
std    15.621379   16.126901   0.115016   39.847948
min    18.000000   51.000000   1.580000  148.000000
25%    24.750000   61.000000   1.705000  194.000000
50%    35.000000   65.000000   1.755000  210.000000
75%    49.750000   78.000000   1.840000  249.000000
max    68.000000  109.000000   1.980000  280.000000

In [175]:
colesterol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [177]:
colesterol.iloc[0:3]

                         nombre  edad sexo  peso  altura  colesterol
0  José Luis Martínez Izquierdo    18    H  85.0    1.79       182.0
1                Rosa Díaz Díaz    32    M  65.0    1.73       232.0
2         Javier García Sánchez    24    H   NaN    1.81       191.0

In [178]:
colesterol['IMC'] = colesterol['peso'] / colesterol['altura']**2

In [179]:
colesterol

,nombre,edad,sexo,peso,altura,colesterol,IMC
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.528510
1,Rosa Díaz Díaz,32,M,65.0,1.73,232.0,21.718066
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN
3,Carmen López Pinzón,35,M,65.0,1.70,200.0,22.491349
4,Marisa López Collado,46,M,51.0,1.58,148.0,20.429418
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.799445
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.957274
7,Pilar Martín González,22,M,60.0,1.66,NaN,21.773842
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.913275
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.913806
10,Macarena Álvarez Luna,53,M,55.0,1.62,262.0,20.957171
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.305471
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.803285
13,Carolina Rubio Moreno,20,M,61.0,1.77,194.0,19.470778

In [183]:
colesterol.iloc[:4, [0, 5]]

                         nombre  colesterol
0  José Luis Martínez Izquierdo       182.0
1                Rosa Díaz Díaz       232.0
2         Javier García Sánchez       191.0
3           Carmen López Pinzón       200.0

In [184]:
colesterol[['nombre', 'colesterol']]

                             nombre  colesterol
0      José Luis Martínez Izquierdo       182.0
1                    Rosa Díaz Díaz       232.0
2             Javier García Sánchez       191.0
3               Carmen López Pinzón       200.0
4              Marisa López Collado       148.0
5                 Antonio Ruiz Cruz       249.0
6           Antonio Fernández Ocaña       276.0
7             Pilar Martín González         NaN
8              Pedro Gálvez Tenorio       241.0
9           Santiago Reillo Manzano       280.0
10            Macarena Álvarez Luna       262.0
11       José María de la Guía Sanz       198.0
12  Miguel Angel Cuadrado Gutiérrez       210.0
13            Carolina Rubio Moreno       194.0

In [186]:
colesterol.to_csv('PRUEBA.csv')

In [188]:
colesterol.loc[:4, ['nombre', 'colesterol']]

                         nombre  colesterol
0  José Luis Martínez Izquierdo       182.0
1                Rosa Díaz Díaz       232.0
2         Javier García Sánchez       191.0
3           Carmen López Pinzón       200.0
4          Marisa López Collado       148.0

In [190]:
colesterol.loc[colesterol['sexo'] == 'H']

,nombre,edad,sexo,peso,altura,colesterol,IMC
0,José Luis Martínez Izquierdo,18,H,85.0,1.79,182.0,26.528510
2,Javier García Sánchez,24,H,NaN,1.81,191.0,NaN
5,Antonio Ruiz Cruz,68,H,66.0,1.74,249.0,21.799445
6,Antonio Fernández Ocaña,51,H,62.0,1.72,276.0,20.957274
8,Pedro Gálvez Tenorio,35,H,90.0,1.94,241.0,23.913275
9,Santiago Reillo Manzano,46,H,75.0,1.85,280.0,21.913806
11,José María de la Guía Sanz,58,H,78.0,1.87,198.0,22.305471
12,Miguel Angel Cuadrado Gutiérrez,27,H,109.0,1.98,210.0,27.803285

In [195]:
colesterol['altura'].mean()

1.7685714285714287